---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ContinuousrailDefaultJoinTypeParam
source: html/792352e3-a289-5efa-3a4d-a21d2d80b1af.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ContinuousrailDefaultJoinTypeParam Property

"Default Join"

## Syntax (C#)
```csharp
public static ForgeTypeId ContinuousrailDefaultJoinTypeParam { get; }
```